Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Example 1. printer_draw_chord() example
es: Ejemplo 1. printer_draw_chord() example

source: Example 1. printer_draw_elipse() example
es: Ejemplo 1. printer_draw_elipse() example

source: Example 1. printer_draw_line() example
es: Ejemplo 1. printer_draw_line() example

source: Example 1. printer_draw_pie() example
es: Ejemplo 1. printer_draw_pie() example

source: Example 1. printer_draw_rectangle() example
es: Ejemplo 1. printer_draw_rectangle() example

source: Example 1. printer_draw_roundrect() example
es: Ejemplo 1. printer_draw_roundrect() example

source: Example 1. printer_draw_text() example
es: Ejemplo 1. printer_draw_text() example

source: Example 1. printer_get_option() example
es: Ejemplo 1. printer_get_option() example

source: Example 1. printer_list() example
es: Ejemplo 1. printer_list() example

source: Example 1. printer_logical_fontheight() example
es: Ejemplo 1. printer_logical_fontheight() example

source: Example 1. printer_open() example
es: Ejemplo 1. printer_open() example

source: Example 1. printer_select_brush() example
es: Ejemplo 1. printer_select_brush() example

source: Example 1. printer_select_font() example
es: Ejemplo 1. printer_select_font() example

source: Example 1. printer_select_pen() example
es: Ejemplo 1. printer_select_pen() example

source: Example 1. printer_set_option() example
es: Ejemplo 1. printer_set_option() example

source: Example 1. printer_start_doc() example
es: Ejemplo 1. printer_start_doc() example

source: Example 1. printer_write() example
es: Ejemplo 1. printer_write() example

source: Produces output according to format, which is described in the documentation for sprintf().
es: Produce una salida según el formato, que es descrito en la documentación para sprintf().

source: See also print(), sprintf(), sscanf(), fscanf(), and flush().
es: Vea también: print(), sprintf(), sscanf(), fscanf(), y flush().

source: See also echo(), printf(), and flush().
es: Vea también: echo(), printf(), y flush().

source: As with anything that outputs its result directly to the browser, you can use the output-control functions to capture the output of this function, and save it in a string (for example).
es: Como con todo lo que presenta un resultado directamente en el navegador, se pueden utilizar las funciones de control de salida para capturar el resultado de esta función y grabarlo - por ejemplo - in una cadena literal.

source: pspell_add_to_personal() adds a word to the personal wordlist.
es: pspell_add_to_personal() agrega una palabra a la lista personal de palabras.

source: If you used pspell_new_config() with pspell_config_personal() to open the dictionary, you can save the wordlist later with pspell_save_wordlist().
es: Si usas pspell_new_config() con pspell_config_personal() para abrir el diccionario, puedes salvar la lista de palabras luego, con pspell_save_wordlist().

source: Please, note that this function will not work unless you have pspell .11.2 and aspell .32.5 or later.
es: Esta función no funcionará hasta que tengas pspell .11.2 y aspell .32.5 o superior.

source: Example 1. pspell_add_to_personal()
es: Ejemplo 1. pspell_add_to_personal()

source: pspell_add_to_session() adds a word to the wordlist associated with the current session.
es: pspell_add_to_session() agrega la palabra a la lista de palabras asociada con la sesión actual.

source: It is very similar to pspell_add_to_personal()
es: Esto es muy similar a pspell_add_to_personal()

source: Example 1. pspell_check()
es: Ejemplo 1. pspell_check()

source: pspell_clear_session() clears the current session.
es: pspell_clear_session() limpia la sesión actual.

source: The current wordlist becomes blank, and, for example, if you try to save it with pspell_save_wordlist(), nothing happens.
es: La lista de palabras actual queda vacía, y, por ejemplo, si intentas salvarla con pspell_save_wordlist(), nada ocurre.

source: Example 1. pspell_config_create()
es: Ejemplo 1. pspell_config_create()

source: Example 1. pspell_config_ignore()
es: Ejemplo 1. pspell_config_ignore()

source: Example 1. pspell_config_mode()
es: Ejemplo 1. pspell_config_mode()

source: Example 1. pspell_config_personal()
es: Ejemplo 1. pspell_config_personal()

source: Example 1. pspell_config_repl()
es: Ejemplo 1. pspell_config_repl()

source: Example 1. pspell_config_runtogether()
es: Ejemplo 1. pspell_config_runtogether()

source: Example 1. pspell_new_config()
es: Ejemplo 1. pspell_new_config()

source: Example 1. pspell_new()
es: Ejemplo 1. pspell_new()

source: Example 1. pspell_new_personal()
es: Ejemplo 1. pspell_new_personal()

source: Example 1. pspell_store_replacement()
es: Ejemplo 1. pspell_store_replacement()

source: Example 1. pspell_suggest()
es: Ejemplo 1. pspell_suggest()

source: The safe_mode_allowed_env_vars directive contains a comma-delimited list of prefixes.
es: Añade setting (valor) al entorno.

source: The safe_mode_protected_env_vars directive contains a comma-delimited list of environment variables, that the end user won' t be able to change using putenv().
es: Establecer una Variable de Entorno

source: Regular Expression Functions (POSIX Extended)
es: Funciones para expresiones regulares

source: This function returns an 8-bit binary string corresponding to the decoded quoted printable string.
es: Esta función devuelve una cadena binaria de 8 bit que se corresponde con la cadena con marcación imprimible decodificada.

source: This function is similar to imap_qprint(), except this one does not require the IMAP module to work.
es: Esta función es similar a imap_qprint(), pero sin requerir que el módulo IMAP funcione.

source: Returns a version of str with a backslash character (\) before every character that is among these:
es: Devuelve una versión de la cadena con una barra invertida (\) antes de cada caracter de este conjunto:

source: See also addslashes(), htmlentities(), htmlspecialchars(), nl2br(), and stripslashes().
es: Vea también addslashes(), htmlentities(), htmlspecialchars(), nl2br(), y stripslashes().

source: If you want a random number between 5 and 15 (inclusive), for example, use rand (5, 15).
es: Si es llamada sin los argumentos opcionales min y max, rand() devuelve un valor pseudo-aleatorio entre 0 y RAND_MAX.

source: See also srand(), getrandmax(), and mt_rand().
es: Vea también srand(), getrandmax(), mt_rand(), mt_srand() y mt_getrandmax().

source: If low high, the sequence will be from high to low.
es: (no version information, might be only in CVS)

source: If a step value is given, it will be used as the increment between elements in the sequence. step should be given as a positive number.
es: rango() devuelve una matriz de enteros desde bajo hasta alto, ambos inclusive.

source: Support for character sequences and decrementing arrays was added in 4.1.0.
es: Vea un ejemplo de su uso en la función shuffle().

source: Example 1. rawurlencode() example 1
es: Ejemplo 1. rawurlencode() example 1

source: Example 2. rawurlencode() example 2
es: Ejemplo 2. rawurlencode() example 2

source: Returns the filename of the next file from the directory.
es: Devuelve el nombre del siguiente fichero en el directorio.

source: The filenames are returned in the order in which they are stored by the filesystem.
es: Los nombres de ficheros no son devueltos en ningun orden especial.

source: Please note the fashion in which readdir() 's return value is checked in the examples below.
es: Listar todos los ficheros en un directorio

source: We are explicitly testing whether the return value is identical to (equal to and of the same type as--see Comparison Operators for more information) FALSE since otherwise, any directory entry whose name evaluates to FALSE will stop the loop (e.g. a directory named "0").
es: ?php $handle=opendir( '.'); echo "Directory handle: $handle\n"; echo "Files:\n"; while ($file = readdir($handle)) {echo "$file\n";} closedir($handle);?

source: List all files in a directory
es: Tener en cuenta que readdir() Tener en cuenta que readdir() devolvera tambien. y..

source: Note that readdir() will return the. and.. entries.
es: Si no quereis estas entradas podeis borrarlas:

source: If you don 't want these, simply strip them out:
es: Ejemplo 2.

source: List all files in the current directory and strip out. and..
es: Listar todos los ficheros en un directorio excepto. y..

source: See also is_dir().
es: ?php $handle=opendir( '.'); while ($file = readdir($handle)) {if ($file != "." $file != ". .") {echo "$file\n";}} closedir($handle);?

source: Reads a file and writes it to the output buffer.
es: Devuelve el número de bytes leidos del fichero.

source: Returns the number of bytes read from the file.
es: Si ocurre un error, se devuelve FALSE y a menos que la función fuera llamada como @readfile, se imprime un mensaje de error

source: See also fpassthru(), file(), fopen(), include(), require(), virtual() and Appendix I.
es: Ver también fpassthru(), file(), fopen(), include(), require(), y virtual().

source: Reads a file, decompresses it and writes it to standard output.
es: Lee el archivo, lo descomprime y lo escribe en la salida estándar.

source: readgzfile() can be used to read a file which is not in gzip format; in this case readgzfile() will directly read from the file without decompression.
es: Readgzfile() puede usarse para leer un archivo comprimido o no con gzip; en cuyo caso readgzfile() leerá directamente el archivo, sin descomprimirlo.

source: If an error occurs, FALSE is returned and unless the function was called as @readgzfile, an error message is printed.
es: Devuelve el numero de bytes (descomprimidos) leídos del archivo, si ocurre un error, se devuelve falso y hasta que se llame como @readgzfile, se imprime un mensaje de error.

source: The file filename will be opened from the filesystem and its contents written to standard output.
es: El archivo nombre_archivo se abrirá en el sistema de archivos y su contenido enviado a la salida estándar.

source: See also gzpassthru(), gzfile(), and gzopen().
es: Ver también gzpassthru(), gzfile(), y gzopen().

source: This function adds a line to the command line history.
es: Esta función añade una línea al historial de líneas de comandos.

source: This function clears the entire command line history.
es: Esta función borra por completo el historial de la línea de comandos.

source: This function registers a completion function.
es: Esta función registra una función de completitud.

source: You must supply the name of an existing function which accepts a partial command line and returns an array of possible matches.
es: Debe proporcionar el nombre de una función existente que acepte una línea de comandos parcial y devuelva una array con posibles coincidencias.

source: This is the same kind of functionality you 'd get if you hit your tab key while using Bash.
es: Es el mismo tipo de funcionalidad que se obtiene al pulsar la tecla de tabulación cuando se está usando el Bash.

source: This function returns a single string from the user.
es: Esta función devuelve una única cadena del usuario.

source: You may specify a string with which to prompt the user.
es: Puede especificar una cadena que se mostrará al usuario.

source: The line returned has the ending newline removed.
es: La línea devuelta tiene el indicador final de nueva línea eliminado.

source: You must add this line to the history yourself using readline_add_history().
es: Necesita añadir esta línea al historial usando la función readline_add_history().

source: Example 1. readline()
es: Ejemplo 1. readline()

source: / / get 3 commands from user for ($i=0; $i 3; $i++) {$line = readline ("Command: "); readline_add_history ($line);} / /dump history print_r (readline_list_history()); / /dump variables print_r (readline_info());
es: / / obtiene 3 comandos del usuario for ($i=0; $i 3; $i++) {$line = readline ("Comando: "); readline_add_history ($line);} / /Vuelca el historial print_r (readline_list_history()); / /Vuelca las variables print_r (readline_info());

source: GNU Recode functions
es: Funciones GNU Recode

source: If called with no parameters, this function returns an array of values for all the setting readline uses.
es: Si es llamada sin parámetros, esta función devuelve un array con los valores de todas las opciones que readline usa.

source: The elements will be indexed by the following values: done, end, erase_empty_line, library_version, line_buffer, mark, pending_input, point, prompt, readline_name, and terminal_name.
es: Los elementos vendrán indexados por los siguientes valores: done, end, erase_empty_line, library_version, line_buffer, mark, pending_input, point, prompt, readline_name, y terminal_name.

source: If called with one parameter, the value of that setting is returned.
es: Si es llamada con un parámetros, devuelve el valor de esa opción.

source: If called with two parameters, the setting will be changed to the given value.
es: Si es llamada con dos parámetros, el valor de la opción será cambiado al parámetro dado.

source: This function returns an array of the entire command line history.
es: Esta función devuelve un array con el historial de líneas de comandos completo.

source: The elements are indexed by integers starting at zero.
es: Los elementos están indexados por enteros comenzando por el cero.

source: This function reads a command history from a file.
es: Esta función lee un historial de comandos desde un fichero.

source: This function writes the command history to a file.
es: Esta función escribe el historial de comandos en un archivo.

source: readlink() does the same as the readlink C function and returns the contents of the symbolic link path or 0 in case of error.
es: readlink() hace lo mismo que la función C readlink C y devuelve el contenido del path del enlace simbólico o 0 en caso de error.

source: See also is_link(), symlink(), and linkinfo().
es: Ver también symlink(), readlink() y linkinfo().

source: Example 1. realpath() example
es: Ejemplo 1. realpath() example

source: Returns FALSE, if unable to comply, TRUE otherwise.
es: Recodifica el fichero definido por input a el fichero definido por output, segun la peticion de recodificacion request.

source: Both filehandles must refer to local files.
es: Devuelve FALSE si no puede realizar la recodificacion, TRUE si todo va bien.

source: Basic recode_file() example
es: Esta funcion no procesa ficheros remotos (URLs).

source: $input = fopen ('input.txt', 'r'); $output = fopen ('output.txt', 'w'); recode_file ("us..flat", $input, $output);
es: Los dos ficheros deben de ser locales en el sistema.

source: Regular Expression Functions (Perl-Compatible)
es: Funciones de expresiones regulares compatibles con Perl

source: Recode the string string according to the recode request request.
es: Recodifica la cadena string segun una peticion de recodificacion request.

source: A simple recode request may be "lat1..iso646-de".
es: Devuelve FALSE si no puede realizar la recodificacion, TRUE si todo va bien.

source: print recode_string ("us..flat", "The following character has a diacritical mark: aacute ;");
es: Ver tambien la documentacion de GNU Recode de tu instalacion para obtener instrucciones detalladas sobre peticiones de recodificacion.

source: Registers the function named by function to be executed when script processing is complete.
es: Registra la función nombrada en func para que se ejecute cuando el script procese su finalización.

source: If you call exit() within one registered shutdown function, processing will stop completely and no other registered shutdown functions will be called.
es: Aviso:

source: The registered shutdown functions are called after the request has been completed (including sending any output buffers), so it is not possible to send output to the browser using echo() or print(), or retrieve the contents of any output buffers using ob_get_contents().
es: Debido a que no se permite ningún tipo de salida en el navegador en esta función, no será capaz de depurarla utilizando sentencias como print o echo.

source: ?php rename( "/ tmp / tmp_file.txt"," / home / user / login / docs / my_file.txt");?
es: Devuelve TRUE en caso de éxito y FALSE en caso de fallo.

source: The require() statement includes and evaluates the specific file.
es: La sentencia require() se sustituye a sí misma con el archivo especificado, tal y como funciona la directiva #include de C.

source: require() includes and evaluates a specific file.
es: Por esta razón, cualquier código dentro del archivo referenciado que debiera ser ejecutado como código PHP debe ser encerrado dentro de etiquetas válidas de comienzo y fin de PHP.

source: Detailed information on how this inclusion works is described in the documentation for include().
es: Está sujeta a algunas reglas distintas de las de funciones.

source: require() and include() are identical in every way except how they handle failure. include() produces a Warning while require() results in a Fatal Error.
es: Por otro lado, no devuelve ningún valor; intentar leer un valor de retorno de una llamada a un require() resulta en un error del intérprete.

source: In other words, don' t hesitate to use require() if you want a missing file to halt processing of the page. include() does not behave this way, the script will continue regardless.
es: Si se quiere incluir condicionalmente un archivo, se usa include().

source: Example 12-2.
es: No obstante, si la línea en la cual aparece el require() no se ejecuta, tampoco se ejecutará el código del archivo referenciado.

source: Basic require() examples
es: De forma similar, las estructuras de bucle no afectan la conducta de require().

source: ?php require 'prepend.php'; require $somefile; require ('somefile.txt');?
es: Aunque el código contenido en el archivo referenciado está todavía sujeto al bucle, el propio require() sólo ocurre una vez.

source: See the include() documentation for more examples.
es: Esto significa que no se puede poner una sentencia require() dentro de una estructura de bucle y esperar que incluya el contenido de un archivo distinto en cada iteración.

source: Prior to PHP 4.0.2, the following applies: require() will always attempt to read the target file, even if the line it's on never executes.
es: When a file is require() ed, the code it contains inherits the variable scope of the line on which the require() When a file is require() ed, the code it contains inherits the variable scope of the line on which the require() occurs.

source: The conditional statement won' t affect require().
es: Any variables available at that line in the calling file will be available within the called file.

source: However, if the line on which the require() occurs is not executed, neither will any of the code in the target file be executed.
es: If the require() occurs inside a function within the calling file, then all of the code contained in the called file will behave as though it had been defined inside that function.

source: Similarly, looping structures do not affect the behaviour of require().
es: This is not strictly speaking the same thing as require() ing the file and having it inherit the parent file's variable scope; the script is actually being run on the remote server and the result is then being included into the local script.

source: Although the code contained in the target file is still subject to the loop, the require() itself happens only once.
es: /* This example assumes that someserver is configured to parse .php * files and not .txt files.

source: See also include(), require_once(), include_once(), eval(), file(), readfile(), virtual() and include_path.
es: Ver tambien include(), require_once(), include_once(), readfile(), y virtual().

source: return
es: switch

source: The require_once() statement includes and evaluates the specified file during the execution of the script.
es: The require_once() statement replaces itself with the specified file, much like the C preprocessor's #include works, and in that respect is similar to the require() statement.

source: This is a behavior similar to the require() This is a behavior similar to the require() statement, with the only difference being that if the code from a file has already been included, it will not be included again.
es: For example, if you create the following 2 include files utils.inc and foolib.inc

source: See the documentation for require() for more information on how this statement works.
es: ?php define( PHPVERSION, floor(phpversion())); echo "GLOBALS ARE NICE\n"; function goodTea() {return "Oolong tea tastes good !";}?

source: require_once() should be used in cases where the same file might be included and evaluated more than once during a particular execution of a script, and you want to be sure that it is included exactly once to avoid problems with function redefinitions, variable value reassignments, etc.
es: ?php require ("utils.inc"); function showVar($var) {if (PHPVERSION == 4) {print_r($var);} else {dump_var($var);}} / / bunch of other functions...?

source: For examples on using require_once() and include_once(), look at the PEAR code included in the latest PHP source code distributions.
es: ?php require( "foolib.inc"); / * the following will generate an error * / require("utils.inc"); $foo = array("1",array("complex" ,"quaternion")); echo "this is requiring utils.inc again which is also\n"; echo "required in foolib.inc\n"; echo "Running goodTea: ".goodTea() ."\n"; echo "Printing foo: \n"; showVar($foo);?

source: Be aware, that the behaviour of require_once() and include_once() may not be what you expect on a non case sensitive operating system (such as Windows).
es: ... require_once( "utils.inc"); function showVar($var) {...

source: Example 12-8. require_once() is case sensitive
es: ... require_once( "foolib.inc"); require_once("utils.inc"); $foo = array("1",array("complex" ,"quaternion"));...

source: require_once( "a.php"); / / this will include a.php require_once("A.php"); / / this will include a.php again on Windows!
es: Oolong tea tastes good!

source: reset() rewinds array's internal pointer to the first element.
es: reset() rebobina el puntero interno de la matriz a su primer elemento.

source: reset() returns the value of the first array element.
es: reset() devuelve el valor del primer elemento de la matriz.

source: See also current(), each(), next(), and prev().
es: Vea también: current(), each(), next(), prev(), y reset().

source: Resets the directory stream indicated by dir_handle to the beginning of the directory.
es: Inizializa la secuencia de directorio determinada por dir_handle al principio del directorio.

source: DOM XML functions
es: Funciones de DOM XML

source: If an error occurs, returns 0, otherwise it returns 1.
es: Fija el indicador de posición del fichero dado por fp al comienzo de del fichero.

source: The file pointer must be valid, and must point to a file successfully opened by fopen().
es: Si ocurre un error, devuelve 0.

source: If you have opened the file in append ("a") mode, any data you write to the file will always be appended, regardless of the file position.
es: El apuntador al fichero debe ser válido, y debe apuntar a un fichero abierto con éxito por fopen().

source: See also fseek() and ftell().
es: Ver también fseek() y ftell().

source: Attempts to remove the directory named by dirname.
es: Trata de eliminar el directorio indicado por pathname.

source: The directory must be empty, and the relevant permissions must permit this.
es: El directorio debe estar vacio, y los permisos relevantes deben permitir esto.

source: See also mkdir() and unlink().
es: Ver también mkdir().

source: PHP doesn' t handle strings like "12,300.2 "correctly by default.
es: Devuelve el valor redondeado de val.
